Hi @liuwuliuyun, I have tested your version and it works with "StorageV2", however when I use "FileStorage" variant for storage account, it fails. We would like to use Premium storage for shares and according to Azure documentation it is available only with "FileStorage" option. Below is my code that doesn't work and throws the same error, I have pasted both the code and the plan/apply output:

`provider "azurerm" {
features {}
}

resource "azurerm_resource_group" "test" {
name     = "rg-io-westeurope-speki-1"
location = "westeurope"
}

resource "azurerm_storage_account" "test" {
name                     = "acctestaccspeki"
resource_group_name      = azurerm_resource_group.test.name
location                 = azurerm_resource_group.test.location
account_tier             = "Standard"
account_replication_type = "LRS"
account_kind             = "FileStorage"
}

resource "azurerm_storage_share" "test" {
name                 = "testsharespeki"
storage_account_name = azurerm_storage_account.test.name
quota                = 100
enabled_protocol     = "SMB"
access_tier          = "Hot"
}`


`$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_resource_group.test will be created
+ resource "azurerm_resource_group" "test" {
+ id       = (known after apply)
+ location = "westeurope"
+ name     = "rg-io-westeurope-speki-1"
}

# azurerm_storage_account.test will be created
+ resource "azurerm_storage_account" "test" {
+ access_tier                       = (known after apply)
+ account_kind                      = "FileStorage"
+ account_replication_type          = "LRS"
+ account_tier                      = "Standard"
+ allow_nested_items_to_be_public   = true
+ cross_tenant_replication_enabled  = true
+ default_to_oauth_authentication   = false
+ enable_https_traffic_only         = true
+ id                                = (known after apply)
+ infrastructure_encryption_enabled = false
+ is_hns_enabled                    = false
+ large_file_share_enabled          = (known after apply)
+ location                          = "westeurope"
+ min_tls_version                   = "TLS1_2"
+ name                              = "acctestaccspeki"
+ nfsv3_enabled                     = false
+ primary_access_key                = (sensitive value)
+ primary_blob_connection_string    = (sensitive value)
+ primary_blob_endpoint             = (known after apply)
+ primary_blob_host                 = (known after apply)
+ primary_connection_string         = (sensitive value)
+ primary_dfs_endpoint              = (known after apply)
+ primary_dfs_host                  = (known after apply)
+ primary_file_endpoint             = (known after apply)
+ primary_file_host                 = (known after apply)
+ primary_location                  = (known after apply)
+ primary_queue_endpoint            = (known after apply)
+ primary_queue_host                = (known after apply)
+ primary_table_endpoint            = (known after apply)
+ primary_table_host                = (known after apply)
+ primary_web_endpoint              = (known after apply)
+ primary_web_host                  = (known after apply)
+ public_network_access_enabled     = true
+ queue_encryption_key_type         = "Service"
+ resource_group_name               = "rg-io-westeurope-speki-1"
+ secondary_access_key              = (sensitive value)
+ secondary_blob_connection_string  = (sensitive value)
+ secondary_blob_endpoint           = (known after apply)
+ secondary_blob_host               = (known after apply)
+ secondary_connection_string       = (sensitive value)
+ secondary_dfs_endpoint            = (known after apply)
+ secondary_dfs_host                = (known after apply)
+ secondary_file_endpoint           = (known after apply)
+ secondary_file_host               = (known after apply)
+ secondary_location                = (known after apply)
+ secondary_queue_endpoint          = (known after apply)
+ secondary_queue_host              = (known after apply)
+ secondary_table_endpoint          = (known after apply)
+ secondary_table_host              = (known after apply)
+ secondary_web_endpoint            = (known after apply)
+ secondary_web_host                = (known after apply)
+ sftp_enabled                      = false
+ shared_access_key_enabled         = true
+ table_encryption_key_type         = "Service"

+ blob_properties {
+ change_feed_enabled           = (known after apply)
+ change_feed_retention_in_days = (known after apply)
+ default_service_version       = (known after apply)
+ last_access_time_enabled      = (known after apply)
+ versioning_enabled            = (known after apply)

+ container_delete_retention_policy {
+ days = (known after apply)
}

+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ delete_retention_policy {
+ days = (known after apply)
}

+ restore_policy {
+ days = (known after apply)
}
}

+ network_rules {
+ bypass                     = (known after apply)
+ default_action             = (known after apply)
+ ip_rules                   = (known after apply)
+ virtual_network_subnet_ids = (known after apply)

+ private_link_access {
+ endpoint_resource_id = (known after apply)
+ endpoint_tenant_id   = (known after apply)
}
}

+ queue_properties {
+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ hour_metrics {
+ enabled               = (known after apply)
+ include_apis          = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
}

+ logging {
+ delete                = (known after apply)
+ read                  = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
+ write                 = (known after apply)
}

+ minute_metrics {
+ enabled               = (known after apply)
+ include_apis          = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
}
}

+ routing {
+ choice                      = (known after apply)
+ publish_internet_endpoints  = (known after apply)
+ publish_microsoft_endpoints = (known after apply)
}

+ share_properties {
+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ retention_policy {
+ days = (known after apply)
}

+ smb {
+ authentication_types            = (known after apply)
+ channel_encryption_type         = (known after apply)
+ kerberos_ticket_encryption_type = (known after apply)
+ multichannel_enabled            = (known after apply)
+ versions                        = (known after apply)
}
}
}

# azurerm_storage_share.test will be created
+ resource "azurerm_storage_share" "test" {
+ access_tier          = "Hot"
+ enabled_protocol     = "SMB"
+ id                   = (known after apply)
+ metadata             = (known after apply)
+ name                 = "testsharespeki"
+ quota                = 100
+ resource_manager_id  = (known after apply)
+ storage_account_name = "acctestaccspeki"
+ url                  = (known after apply)
}

Plan: 3 to add, 0 to change, 0 to destroy.
`


`terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_resource_group.test will be created
+ resource "azurerm_resource_group" "test" {
+ id       = (known after apply)
+ location = "westeurope"
+ name     = "rg-io-westeurope-speki-1"
}

# azurerm_storage_account.test will be created
+ resource "azurerm_storage_account" "test" {
+ access_tier                       = (known after apply)
+ account_kind                      = "FileStorage"
+ account_replication_type          = "LRS"
+ account_tier                      = "Standard"
+ allow_nested_items_to_be_public   = true
+ cross_tenant_replication_enabled  = true
+ default_to_oauth_authentication   = false
+ enable_https_traffic_only         = true
+ id                                = (known after apply)
+ infrastructure_encryption_enabled = false
+ is_hns_enabled                    = false
+ large_file_share_enabled          = (known after apply)
+ location                          = "westeurope"
+ min_tls_version                   = "TLS1_2"
+ name                              = "acctestaccspeki"
+ nfsv3_enabled                     = false
+ primary_access_key                = (sensitive value)
+ primary_blob_connection_string    = (sensitive value)
+ primary_blob_endpoint             = (known after apply)
+ primary_blob_host                 = (known after apply)
+ primary_connection_string         = (sensitive value)
+ primary_dfs_endpoint              = (known after apply)
+ primary_dfs_host                  = (known after apply)
+ primary_file_endpoint             = (known after apply)
+ primary_file_host                 = (known after apply)
+ primary_location                  = (known after apply)
+ primary_queue_endpoint            = (known after apply)
+ primary_queue_host                = (known after apply)
+ primary_table_endpoint            = (known after apply)
+ primary_table_host                = (known after apply)
+ primary_web_endpoint              = (known after apply)
+ primary_web_host                  = (known after apply)
+ public_network_access_enabled     = true
+ queue_encryption_key_type         = "Service"
+ resource_group_name               = "rg-io-westeurope-speki-1"
+ secondary_access_key              = (sensitive value)
+ secondary_blob_connection_string  = (sensitive value)
+ secondary_blob_endpoint           = (known after apply)
+ secondary_blob_host               = (known after apply)
+ secondary_connection_string       = (sensitive value)
+ secondary_dfs_endpoint            = (known after apply)
+ secondary_dfs_host                = (known after apply)
+ secondary_file_endpoint           = (known after apply)
+ secondary_file_host               = (known after apply)
+ secondary_location                = (known after apply)
+ secondary_queue_endpoint          = (known after apply)
+ secondary_queue_host              = (known after apply)
+ secondary_table_endpoint          = (known after apply)
+ secondary_table_host              = (known after apply)
+ secondary_web_endpoint            = (known after apply)
+ secondary_web_host                = (known after apply)
+ sftp_enabled                      = false
+ shared_access_key_enabled         = true
+ table_encryption_key_type         = "Service"

+ blob_properties {
+ change_feed_enabled           = (known after apply)
+ change_feed_retention_in_days = (known after apply)
+ default_service_version       = (known after apply)
+ last_access_time_enabled      = (known after apply)
+ versioning_enabled            = (known after apply)

+ container_delete_retention_policy {
+ days = (known after apply)
}

+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ delete_retention_policy {
+ days = (known after apply)
}

+ restore_policy {
+ days = (known after apply)
}
}

+ network_rules {
+ bypass                     = (known after apply)
+ default_action             = (known after apply)
+ ip_rules                   = (known after apply)
+ virtual_network_subnet_ids = (known after apply)

+ private_link_access {
+ endpoint_resource_id = (known after apply)
+ endpoint_tenant_id   = (known after apply)
}
}

+ queue_properties {
+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ hour_metrics {
+ enabled               = (known after apply)
+ include_apis          = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
}

+ logging {
+ delete                = (known after apply)
+ read                  = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
+ write                 = (known after apply)
}

+ minute_metrics {
+ enabled               = (known after apply)
+ include_apis          = (known after apply)
+ retention_policy_days = (known after apply)
+ version               = (known after apply)
}
}

+ routing {
+ choice                      = (known after apply)
+ publish_internet_endpoints  = (known after apply)
+ publish_microsoft_endpoints = (known after apply)
}

+ share_properties {
+ cors_rule {
+ allowed_headers    = (known after apply)
+ allowed_methods    = (known after apply)
+ allowed_origins    = (known after apply)
+ exposed_headers    = (known after apply)
+ max_age_in_seconds = (known after apply)
}

+ retention_policy {
+ days = (known after apply)
}

+ smb {
+ authentication_types            = (known after apply)
+ channel_encryption_type         = (known after apply)
+ kerberos_ticket_encryption_type = (known after apply)
+ multichannel_enabled            = (known after apply)
+ versions                        = (known after apply)
}
}
}

# azurerm_storage_share.test will be created
+ resource "azurerm_storage_share" "test" {
+ access_tier          = "Hot"
+ enabled_protocol     = "SMB"
+ id                   = (known after apply)
+ metadata             = (known after apply)
+ name                 = "testsharespeki"
+ quota                = 100
+ resource_manager_id  = (known after apply)
+ storage_account_name = "acctestaccspeki"
+ url                  = (known after apply)
}

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
Terraform will perform the actions described above.
Only 'yes' will be accepted to approve.

Enter a value: yes

azurerm_resource_group.test: Creating...
azurerm_resource_group.test: Creation complete after 1s [id=/subscriptions/28404f1f-5186-4bd0-9045-a00b639a34a0/resourceGroups/rg-io-westeurope-speki-1]
azurerm_storage_account.test: Creating...
╷
│ Error: creating Azure Storage Account "acctestaccspeki": storage.AccountsClient#Create: Failure sending request: StatusCode=400 -- Original Error: Code="InvalidValuesForRequestParameters" Message="Values for request parameters are invalid: kind, sku. For more information, see - https://aka.ms/storageaccounttypes"
│
│   with azurerm_storage_account.test,
│   on bugtest.tf line 10, in resource "azurerm_storage_account" "test":
│   10: resource "azurerm_storage_account" "test" {
│
╵`

